Model: "sequential_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
cropping2d_1 (Cropping2D)    (None, 90, 320, 3)        0         
_________________________________________________________________
lambda_1 (Lambda)            (None, 90, 320, 3)        0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 86, 158, 16)       1216      
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, 86, 158, 16)       0         
_________________________________________________________________
average_pooling2d_1 (Average (None, 43, 79, 16)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 39, 38, 24)        9624      
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, 39, 38, 24)        0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 35, 17, 26)        15626     
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, 35, 17, 26)        0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 31, 7, 30)         19530     
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, 31, 7, 30)         0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 31, 7, 30)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 6510)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 30)                195330    
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, 30)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 15)                465       
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, 15)                0         
_________________________________________________________________
dense_3 (Dense)              (None, 11)                176       
_________________________________________________________________
dense_4 (Dense)              (None, 8)                 96        
_________________________________________________________________
dense_5 (Dense)              (None, 2)                 18        
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, 2)                 0         
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 3         
=================================================================
Total params: 242,084
Trainable params: 242,084
Non-trainable params: 0
_________________________________________________________________
Epoch 26/30
100/100 [==============================] - 17s 174ms/step - loss: 0.0412 - val_loss: 0.0429
Epoch 27/30
100/100 [==============================] - 17s 174ms/step - loss: 0.0391 - val_loss: 0.0422
Epoch 28/30
100/100 [==============================] - 18s 175ms/step - loss: 0.0415 - val_loss: 0.0299
Epoch 29/30
100/100 [==============================] - 17s 173ms/step - loss: 0.0379 - val_loss: 0.0322
Epoch 30/30
100/100 [==============================] - 17s 170ms/step - loss: 0.0375 - val_loss: 0.0263


